raw/sysbench-iobound_heavy-1000-hdd-pareto-psfm32-rocks-large-48-ranges_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 48
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Threads started!

[  10s] threads: 48, tps: 1305.39, reads: 4876.75, writes: 0.00, response time: 56.58ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 48, tps: 121.50, reads: 451.90, writes: 0.00, response time: 1958.14ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 48, tps: 94.20, reads: 352.39, writes: 0.00, response time: 2674.08ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 48, tps: 106.40, reads: 396.61, writes: 0.00, response time: 2617.06ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 48, tps: 110.20, reads: 410.39, writes: 0.00, response time: 2285.20ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 48, tps: 103.40, reads: 386.20, writes: 0.00, response time: 2511.16ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 48, tps: 104.00, reads: 386.00, writes: 0.00, response time: 2591.34ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 48, tps: 108.00, reads: 401.60, writes: 0.00, response time: 2343.39ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 48, tps: 110.80, reads: 414.40, writes: 0.00, response time: 2336.38ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 48, tps: 117.30, reads: 433.40, writes: 0.00, response time: 2434.19ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 48, tps: 118.00, reads: 435.90, writes: 0.00, response time: 2378.72ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 48, tps: 123.90, reads: 461.20, writes: 0.00, response time: 2185.51ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 48, tps: 111.50, reads: 419.70, writes: 0.00, response time: 2426.18ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 48, tps: 115.40, reads: 428.40, writes: 0.00, response time: 2254.62ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 48, tps: 122.00, reads: 457.00, writes: 0.00, response time: 2356.75ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 48, tps: 111.70, reads: 416.70, writes: 0.00, response time: 2451.00ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 48, tps: 130.90, reads: 490.20, writes: 0.00, response time: 2227.79ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 48, tps: 127.70, reads: 474.00, writes: 0.00, response time: 2259.35ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 48, tps: 125.70, reads: 464.80, writes: 0.00, response time: 2174.42ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 48, tps: 118.50, reads: 439.20, writes: 0.00, response time: 2426.18ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 48, tps: 127.20, reads: 475.69, writes: 0.00, response time: 2167.92ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 48, tps: 124.70, reads: 464.61, writes: 0.00, response time: 2165.33ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 48, tps: 134.60, reads: 504.60, writes: 0.00, response time: 2188.13ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 48, tps: 119.00, reads: 440.60, writes: 0.00, response time: 2393.72ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 48, tps: 122.80, reads: 455.70, writes: 0.00, response time: 2324.52ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 48, tps: 123.10, reads: 461.60, writes: 0.00, response time: 2314.11ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 48, tps: 125.30, reads: 467.50, writes: 0.00, response time: 2221.13ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 48, tps: 137.80, reads: 512.90, writes: 0.00, response time: 2202.59ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 48, tps: 122.10, reads: 454.90, writes: 0.00, response time: 2449.54ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 48, tps: 149.70, reads: 553.60, writes: 0.00, response time: 1948.78ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            177995
        write:                           0
        other:                           47776
        total:                           225771
    transactions:                        47776  (158.87 per sec.)
    read/write requests:                 177995 (591.90 per sec.)
    other operations:                    47776  (158.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.7198s
    total number of events:              47776
    total time taken by event execution: 14418.8914s
    response time:
         min:                                  0.75ms
         avg:                                301.80ms
         max:                               8756.81ms
         approx.  95 percentile:            2003.19ms

Threads fairness:
    events (avg/stddev):           995.3333/55.81
    execution time (avg/stddev):   300.3936/0.23