raw/sysbench-iobound_heavy-1000-slowssd-pareto-psfm32-rocks-large-4-ranges_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Threads started!

setting write concern to 1
[  10s] threads: 4, tps: 261.40, reads: 971.72, writes: 0.00, response time: 21.66ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 4, tps: 269.59, reads: 1003.58, writes: 0.00, response time: 21.09ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 4, tps: 266.30, reads: 986.12, writes: 0.00, response time: 21.71ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 4, tps: 259.30, reads: 967.18, writes: 0.00, response time: 23.78ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 4, tps: 271.21, reads: 1009.12, writes: 0.00, response time: 20.59ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 4, tps: 227.30, reads: 847.09, writes: 0.00, response time: 38.14ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 4, tps: 227.50, reads: 842.31, writes: 0.00, response time: 38.01ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 4, tps: 234.60, reads: 873.91, writes: 0.00, response time: 37.79ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 4, tps: 234.70, reads: 874.29, writes: 0.00, response time: 37.59ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 4, tps: 238.30, reads: 889.08, writes: 0.00, response time: 37.21ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 4, tps: 238.20, reads: 889.42, writes: 0.00, response time: 37.26ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 4, tps: 235.90, reads: 880.58, writes: 0.00, response time: 37.14ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 4, tps: 240.91, reads: 896.02, writes: 0.00, response time: 35.87ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 4, tps: 244.29, reads: 914.88, writes: 0.00, response time: 34.11ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 4, tps: 240.50, reads: 896.32, writes: 0.00, response time: 37.48ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 4, tps: 241.50, reads: 897.48, writes: 0.00, response time: 34.75ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 4, tps: 236.70, reads: 879.42, writes: 0.00, response time: 33.52ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 4, tps: 242.50, reads: 904.79, writes: 0.00, response time: 33.22ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 4, tps: 241.80, reads: 899.31, writes: 0.00, response time: 33.36ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 4, tps: 249.90, reads: 928.82, writes: 0.00, response time: 31.76ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 4, tps: 255.40, reads: 957.58, writes: 0.00, response time: 30.11ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 4, tps: 249.40, reads: 928.38, writes: 0.00, response time: 32.23ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 4, tps: 250.90, reads: 935.42, writes: 0.00, response time: 29.88ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 4, tps: 252.70, reads: 943.68, writes: 0.00, response time: 29.75ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 4, tps: 252.01, reads: 940.22, writes: 0.00, response time: 26.38ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 4, tps: 246.69, reads: 921.18, writes: 0.00, response time: 31.40ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 4, tps: 249.50, reads: 931.02, writes: 0.00, response time: 25.60ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 4, tps: 257.80, reads: 958.78, writes: 0.00, response time: 25.20ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 4, tps: 257.20, reads: 959.52, writes: 0.00, response time: 29.80ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 4, tps: 260.80, reads: 971.18, writes: 0.00, response time: 24.48ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            276994
        write:                           0
        other:                           74352
        total:                           351346
    transactions:                        74352  (247.83 per sec.)
    read/write requests:                 276994 (923.28 per sec.)
    other operations:                    74352  (247.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0100s
    total number of events:              74352
    total time taken by event execution: 1199.9449s
    response time:
         min:                                  0.71ms
         avg:                                 16.14ms
         max:                                 75.63ms
         approx.  95 percentile:              32.53ms

Threads fairness:
    events (avg/stddev):           18588.0000/141.96
    execution time (avg/stddev):   299.9862/0.00